"""
Програма використовує список чисел з повторами,
підраховує кількість кожного числа за допомогою словника і визначає те, яке повторюється найчастіше.
"""

numbers = [
    5, 3, 8, 5, 2, 8, 3, 9, 1, 8, 5, 2, 3, 5, 7, 3, 8, 9, 5, 6,
    1, 2, 3, 5, 8, 7, 3, 5, 2, 3, 6, 8, 5, 5, 4, 3, 8, 9, 5, 2,
    6, 3, 7, 8, 5, 3, 2, 8, 5, 1
]

counts = {}

for num in numbers:
    if num in counts:
        counts[num] += 1
    else:
        counts[num] = 1


max_number = max(counts, key=counts.get)
print(f"Число {max_number} повторюється найбільше разів: {counts[max_number]}")
