import random  # Імпортуємо модуль для випадкових чисел

# Генеруємо випадковий тризначний код
code = random.randint(100, 999)
attempts = 0  # Лічильник спроб

print("Гра почалась. У вас 5 спроб, щоб зламати код!")

# Цикл виконується, поки кількість спроб менш як 5
while attempts != 5:
    try:
        # Користувач вводить число
        guess = int(input("Введіть трьохзначний код: "))

        # Перевірка, чи число тризначний
        if guess < 100 or guess > 999:
            print("Введіть ТРЬОХЗНАЧНЕ число!")
            continue  # Пропускаємо решту ітерації, переходимо до наступної

        # Якщо введене число збігається з кодом
        if guess == code:
            print("Вітаємо! Ви зламали сейф!")
            break  # Вихід із циклу
        elif guess < code:
            print("Код більший.")  # Підказка
        else:
            print("Код менший.")  # Підказка

    # Якщо користувач ввів не число
    except ValueError:
        print("Помилка: введіть лише числа!")

    finally:
        # Збільшуємо кількість спроб після кожного вводу
        attempts += 1

        # Якщо спроби ще є
        if attempts != 5:
            print("Залишилось спроб:", 5 - attempts)
        else:
            # Якщо спроби закінчились
            print(f"Спроби закінчилися! Код сейфу був: {code}")